; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared4 - mode
	thermograph2 - mode
	spectrograph1 - mode
	image0 - mode
	spectrograph3 - mode
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star2 - direction
	Star1 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared4)
	(supports instrument2 image0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
)
(:goal (and
	(have_image Star9 spectrograph3)
	(have_image Star10 spectrograph1)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 image0)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 infrared4)
	(have_image Planet15 infrared4)
	(have_image Planet16 image0)
	(have_image Star17 image0)
))

)

; plan
1. (turn_to satellite0 groundstation3 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet16 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet16)
   goals met: 0 of 9
5. (take_image satellite0 planet16 instrument1 image0)
   added: (have_image planet16 image0)
   goals met: 1 of 9
6. (turn_to satellite0 planet13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet13)
   goals met: 1 of 9
7. (take_image satellite0 planet13 instrument1 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 3 of 9
10. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 3 of 9
11. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 4 of 9
12. (turn_to satellite0 star17 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star17)
   goals met: 4 of 9
13. (take_image satellite0 star17 instrument1 image0)
   added: (have_image star17 image0)
   goals met: 5 of 9
14. (turn_to satellite0 star9 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star9)
   goals met: 5 of 9
15. (take_image satellite0 star9 instrument1 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 6 of 9
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 9
17. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 9
18. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 9
19. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 6 of 9
20. (turn_to satellite0 planet11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet11)
   goals met: 6 of 9
21. (take_image satellite0 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 7 of 9
22. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 7 of 9
23. (take_image satellite0 planet14 instrument2 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 8 of 9
24. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 8 of 9
25. (take_image satellite0 planet15 instrument2 infrared4)
   added: (have_image planet15 infrared4)
   goals met: 9 of 9
